app/controllers/messages_controller.rb

SELECT * FROM "messages"
---
  def index
    @messages = Message.all

INSERT INTO "messages" ("FromState", "ToState", "AccountSid", "created_at", "Body", "From", "FromCity", "updated_at", "To", "FromZip", "FromCountry", "ToCity", "ToZip", "ToCountry", "SmsSid") VALUES(NULL, NULL, NULL, '2011-08-10 01:42:26', NULL, NULL, NULL, '2011-08-10 01:42:26', NULL, NULL, NULL, NULL, NULL, NULL, NULL)
---
  def create
    if count_messages_by_sender <= 5
      @message = Message.new(:AccountSid => params[:AccountSid], :From => params[:From], :To => params[:To], :Body => params[:Body],
        :FromCity => params[:FromCity], :FromState => params[:FromState], :FromZip => params[:FromZip], :FromCountry => params[:FromCountry],
        :ToCity => params[:ToCity], :ToState => params[:ToState], :ToZip => params[:ToZip], :ToCountry => params[:ToCountry])
      #@message = Message.new(params[:message])

      respond_to do |format|
        if @message.save